import sympy  # Імпортуємо математичний пакет сампай, який дозволить нам виконати інтегрування та записати підінтегральну функію


a = float(input('Введіть нижню границю: '))  # Вводимо нижню границю у нашому прикладі '0'
b = float(input('Введіть верхню границю: '))  # Вводимо верхню границю у нашому прикладі '1'
n = int(input('Введіть кількість розбиттів: '))  # Вводимо кількість розбиттів у нашому прикладі '100'

x = sympy.symbols('x')  # Оголошуємо, що в нас буде змінна 'х' у функціях
h = (b-a)/n  # Обчислюємо крок
start_integral = x/(x+1)  # Записуємо функцію початкового інтегралу
result_integration = sympy.integrate(x/(x+1),x)  # Інтегруємо, щоб побачити вигляд інтегралу та вручну порахувати відносну похибку
area = 0  # Вводимо змінну, в яку будемо заносити численне значення площі кожного кроку
x_0 = a  # Визначаємо значення початкового вузлу
x_n = a + h * n  # Визначаємо значення кінцевого вузлу
for i in range(1,n):  # Проходимо по кількості точок
    x_i = a + h * i  # Визначаємо значення для вузлів крім першого та останнього
    result_digit = start_integral.subs(x,x_i)  # Підставляємо значення вузлів в підінтегральну функцію та вираховуєм значення
    area += result_digit  # Додаємо значення до змінною,яка зберігає суму попередніх значень
#  Підставляємо значення першого та останнього вузлу в підінтегральну функцію та вираховуєм їхні значення після чого сумуємо їх та ділимо на 2
# Далі додаємо суму підінтегральних функцій інших вузлів та множимо все на наш крок(все виконано за формулою методу трапецій)
area = h*((start_integral.subs(x,x_0)+start_integral.subs(x,x_n)/2)+area)
print(f'Результат інтегрування: {result_integration}')  # Вивід наших результатів
print(f'Значення інтегралу: {area}')
